a = int(input('Введите число : '))
b = a*1
c = b*a
d = c*a
e = d*a
f = e*a
q = f*f*d
print('В 5 степень за 5 операций')
print('Первая операция a^1=',b)
print('Вторая операция: a^2=',c)
print('Третья операция: a^3=',d)
print('Четвёртая операция: a^4=',e)
print('Пятая операция a^5=',f)
print('В 13 степень за 5 операций')
print('Первая операция a^2=',c)
print('Вторая операция: a^3=',d)
print('Третья операция: a^4=',e)
print('Четвёртая операция: a^5=',f)
print('Пятая операция a^13=',q)
